let data = [
  {
    id: "GD",
    items: [
      {
        title: "تصميم العلامة التجارية",
        content:
          "نحن متخصصون في صياغة هويات تجارية فريدة وجذابة تعكس جوهرك وتفردك. يتضمن ذلك إنشاء شعارات مميزة وتحديد الألوان التي تمثل علامتك التجارية.",
      },
      {
        title: "الرسوم المتحركة",
        content:
          "ارفع مستوى علامتك التجارية باستخدام الرسومات المتحركة الديناميكية والجذابة. نحن نضفي الحيوية على المحتوى الخاص بك من خلال العناصر المرئية المتحركة، مما يضيف بُعدًا آسرًا إلى رسائلك.",
      },
      {
        title: "تصميم شعار",
        content:
          "يقوم فريق الخبراء لدينا بتصميم الشعارات التي تكون بمثابة حجر الزاوية البصري لعلامتك التجارية. نقوم بإنشاء شعارات لا تُنسى ومتعددة الاستخدامات تترك انطباعًا دائمًا لدى جمهورك.",
      },
      {
        title: "تصاميم وسائل التواصل الاجتماعي",
        content:
          "عزز تواجدك على الإنترنت من خلال تصميمات الوسائط الاجتماعية الجذابة. نحن نصمم صورًا مرئية لمختلف المنصات، مما يضمن الاتساق والصدى مع جمهورك المستهدف.",
      },
      {
        title: "الطباعة والتغليف",
        content:
          "من بطاقات العمل إلى مواد التعبئة والتغليف، نقدم حلول طباعة وتغليف عالية الجودة. ارفع صورة علامتك التجارية باستخدام مواد مطبوعة مصنوعة باحترافية.",
      },
      {
        title: "إنشاء ملف تعريف الشركة",
        content:
          "اسمح لنا بمساعدتك في عرض نقاط القوة والإنجازات التي حققتها شركتك من خلال ملف تعريفي للشركة تم إعداده بشكل احترافي. نحن نسلط الضوء على إنجازاتك وعروضك الرئيسية لترك انطباع دائم لدى العملاء المحتملين.",
      },
      {
        title: "إنشاء الهوية البصرية",
        content:
          "نقوم بتطوير هوية بصرية متماسكة لعلامتك التجارية، تشمل كل شيء بدءًا من الشعارات وحتى أنظمة الألوان. يضمن هذا النهج الشامل التعرف على علامتك التجارية وتذكرها عبر مختلف المنصات والوسائط.",
      },
    ],
  },
  {
    id: "DM",
    items: [
      {
        title: "إدارة وسائل التواصل الاجتماعي",
        content:
          "التعامل بخبرة مع إدارة الحملات والتفاعل مع الرسائل والتعليقات وإنشاء محتوى مقنع. قم بتطوير خطط تسويقية شاملة، وتصميم منشورات جذابة بصريًا، وضمان النشر الاستراتيجي وفي الوقت المناسب عبر منصات التواصل الاجتماعي.",
      },
      {
        title: "خدمة الرسائل القصيرة",
        content:
          "استخدم الرسائل القصيرة للتواصل المباشر والإشعارات والرسائل التسويقية الفعالة. استغل قوة الرسائل المختصرة للتفاعل مع جمهورك ونقل المعلومات المهمة على الفور.",
      },
      {
        title: "التسويق عبر محركات البحث",
        content:
          "تخطيط وتنفيذ الحملات الإعلانية المدفوعة بكفاءة على محركات البحث الرئيسية. استفد من الاستراتيجيات مثل الدفع لكل نقرة (PPC) لزيادة الرؤية عبر الإنترنت وزيادة حركة المرور على موقع الويب من خلال الإعلانات المدفوعة المستهدفة.",
      },
      {
        title: "تحسين محركات البحث (SEO)",
        content:
          "تحسين محتوى موقع الويب وبنيته لتحقيق تصنيفات أعلى في محرك البحث. قم بإجراء بحث شامل عن الكلمات الرئيسية، ودمج الكلمات الرئيسية بسلاسة، وقم بتنفيذ تقنيات تحسين محركات البحث (SEO) على الصفحة وخارجها. رفع مستوى الرؤية العضوية، مما يضمن أن موقع الويب يجذب حركة المرور ذات الصلة والمستهدفة.",
      },
      {
        title: "إعلانات جوجل",
        content:
          "إنشاء وإدارة الإعلانات المؤثرة على منصات جوجل. قم بتصميم الحملات للوصول إلى جمهورك المستهدف بشكل فعال، مما يؤدي إلى تعظيم إمكانات النظام البيئي الإعلاني في Google لزيادة ظهور العلامة التجارية والمشاركة.",
      },
    ],
  },
  {
    id: "OM",
    items: [
      {
        title: "لوحات اعلانية",
        content:
          "تصميم وإنتاج لوحات إعلانية مؤثرة تعزز رؤية علامتك التجارية وتسويقها. سواء للمساحات الخارجية أو الداخلية، فإننا نقدم تصميمات تلبي احتياجاتك وتجذب الانتباه بشكل فعال.",
      },
      {
        title: "خطط التسويق",
        content:
          "قم بإعداد خطط تسويقية دقيقة مصممة خصيصًا لأهدافك الإستراتيجية. من خلال تحليل السوق وتحديد الجمهور المستهدف، نقدم استراتيجيات تسويقية فعالة لتعزيز نجاح عملك وزيادة ظهور علامتك التجارية.",
      },
    ],
  },
  {
    id: "GS",
    items: [
      {
        title: "خرائط جوجل",
        content:
          "نضيف عملك أو شركتك إلى خرائط Google لتسهيل اكتشافها بسهولة.",
      },
      {
        title: "التصوير ثلاثي الأبعاد",
        content:
          "نحن نقدم إمكانية التصوير ثلاثي الأبعاد لتوفير تجربة فريدة في عرض أعمالك.",
      },
      {
        title: "جولات افتراضية",
        content:
          "يمكننا دمج الجولات الافتراضية في موقعك على خرائط Google، مما يسهل على الأشخاص التعرف على مكانك على الخريطة.",
      },
    ],
  },
  {
    id: "PR",
    items: [
      {
        title: "الإعلام والعلاقات العامة",
        content:
          "التعامل مع وسائل الإعلام وتنظيم البيانات الصحفية لتسليط الضوء على أحداث وإنجازات المنظمة.",
      },
      {
        title: "علاقات حكومية",
        content:
          "يتعامل مع التفاعلات مع الجهات الحكومية ويساهم في الحفاظ على التوازن بين المنظمة والسلطات الحكومية.",
      },
      {
        title: "التواصل الداخلي",
        content:
          "يركز على تعزيز التواصل داخل المنظمة بين مختلف الإدارات والموظفين.",
      },
      {
        title: "إدارة الأزمات",
        content:
          "يدير الاستجابات للأزمات ويتعامل مع حالات الطوارئ لحماية سمعة المنظمة.",
      },
      {
        title: "اتصالات دولية",
        content:
          "إذا كانت المنظمة تعمل على المستوى الدولي، فقد يكون هناك قسم متخصص لإدارة العلاقات مع الشركاء والجماهير الدوليين.",
      },
    ],
  },
  {
    id: "CM",
    items: [
      {
        title: "تسويق المشاهير",
        content:
          "يتضمن تصميم وتنفيذ حملات تسويقية تستفيد من تأثير الشخصيات الشهيرة للترويج للمنتجات أو الخدمات.",
      },
      {
        title: "إدارة العقود والاتفاقيات",
        content:
          "يدير عمليات التفاوض ويشرف على توقيع العقود بين الشركة والمشاهير، مما يضمن الامتثال للشروط المتفق عليها.",
      },
      {
        title: "علاقات المشاهير",
        content:
          "يركز على بناء وتعزيز العلاقات مع المشاهير، وضمان رضاهم وفهمهم لأهداف الحملات التسويقية.",
      },
      {
        title: "التحليل والتقييم",
        content:
          "يقيم فعالية الحملات التسويقية للمشاهير ويحلل الأداء لتعزيز الاستراتيجيات المستقبلية.",
      },
      {
        title: "التنسيق الإعلامي",
        content:
          "يدير التفاعلات مع وسائل الإعلام وينسق تغطية أحداث المشاهير والأنشطة ذات الصلة.",
      },
    ],
  },
];

let pop1 = document.getElementById("pop1");
let pop2 = document.getElementById("pop2");
let mainCat = document.querySelectorAll(".mainPage");
let closeBtn = document.querySelectorAll(".close");
let itemsInner = document.querySelector(".itemsInner");
let sub = document.getElementById("sub");

function showItems(element) {
  let filterd = data.filter((e) => e.id === element.id);
  if (filterd.length !== 0) {
    itemsInner.innerHTML = "";
    for (let i = 0; i < filterd[0].items.length; i++) {
      itemsInner.innerHTML += `
      <div class="item opacity" style="animation: fadebtm 800ms alternate ${
        (i + 1) * 100
      }ms forwards;">
        <div class="itemHead">${i <= 9 ? "0" + (+i + 1) : i + 1}</div>
        <div class="content">
          <span>${filterd[0].items[i].title}</span>
          <p>${filterd[0].items[i].content}</p>
        </div>
      </div>
      `;
    }
    pop2.style.display = "flex";
  } else {
    window.location = "https://petra-ms.netlify.app/soon";
  }
}

mainCat.forEach((e) => {
  e.addEventListener("click", () => {
    pop1.style.display = "none";
    showItems(e);
  });
});
closeBtn.forEach((e) => {
  e.addEventListener("click", () => {
    pop1.style.display = "none";
    pop2.style.display = "none";
  });
});

sub.addEventListener("click", () => {
  pop2.style.display = "none";
  pop1.style.display = "flex";
});
